# Parameter Type Id View Position X Property

Source: https://www.revitapidocs.com/2026/e458ad48-b12d-5c94-f53c-2c469e668458.htm

---

| Parameter Type Id View Position X Property |
| --- |

"View Position X"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId ViewPositionX { get; }
```

```
Public Shared ReadOnly Property ViewPositionX As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ ViewPositionX {
	ForgeTypeId^ get ();
}
```

```
static member ViewPositionX : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace